src/Catalogs/ИТСервисы_Проекты/ИТСервисы_Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_Проекты</name>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПространствоKaiten</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТребованияККоманде</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемыйГрейд</name>
      <type>
        <types>EnumRef.ИТСервисы_Грейды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательнаяКомпетенция</name>
      <type>
        <types>CatalogRef.ИТСервисы_Компетенции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ИТСервисы_Проекты/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИТСервис) И ЗначениеЗаполнено(Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	1 КАК Поле1
			|ИЗ
			|	Справочник.ИТСервисы_ИТСервисы.Организации КАК ТЧ_Организации
			|ГДЕ
			|	ТЧ_Организации.Ссылка = &ИТСервис
			|	И ТЧ_Организации.Организация = &Организация";
		
		Запрос.УстановитьПараметр("ИТСервис", ИТСервис);
		Запрос.УстановитьПараметр("Организация", Организация);

		Если Запрос.Выполнить().Пустой() Тогда
			
			ТекстОшибки = СтрШаблон(
				"Выбранная организация «%1» отсутствует в списке допустимых организаций для ИТ-Сервиса «%2».", 
				Организация, 
				ИТСервис
			);	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Поле = "Организация"; 
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;		
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПлановаяДатаНачала) И ЗначениеЗаполнено(ПлановаяДатаОкончания) Тогда
		Если ПлановаяДатаНачала > ПлановаяДатаОкончания Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Плановая дата начала не может быть больше плановой даты окончания!";
			Сообщение.Поле  = "ПлановаяДатаНачала";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		Если ДатаНачала > ДатаОкончания Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Фактическая дата начала не может быть больше даты окончания!";
			Сообщение.Поле  = "ДатаНачала";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
